     A*=====================================================================
     A* DBSDK Configuration Administration - Kafka Configuration Display
     A*=====================================================================
     A* Purpose: Kafka configuration screen for editing user settings
     A*
     A* Compilation:
     A*   CRTSRCPF FILE(QTEMP/QDDSSRC) RCDLEN(112)
     A*   CPYFRMSTMF FROMSTMF('/home/jwoehr/work/AI/DbToo/AI-SDK-Db2-IBMi/src/admin/dspf/CFGKAFKAD.dspf') +
     A*              TOMBR('/QSYS.LIB/QTEMP.LIB/QDDSSRC.FILE/CFGKAFKAD.MBR') +
     A*              MBROPT(*REPLACE)
     A*   CRTDSPF FILE(DBSDK_V1/CFGKAFKAD) SRCFILE(QTEMP/QDDSSRC) SRCMBR(CFGKAFKAD)
     A*
     A* Author: AI-SDK-Db2-IBMi Project
     A* Date: 2026-03-22
     A*=====================================================================
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      INDARA
     A                                      CA03(03 'Exit')
     A                                      CA12(12 'Cancel')
     A          R KFCONFIG
     A                                      OVERLAY
     A*=====================================================================
     A* Screen Title and Header
     A*=====================================================================
     A                                  1  2'DBSDK Configuration Administra-
     A                                      tion'
     A                                      DSPATR(HI)
     A                                  1 70TIME
     A                                  2  2'Kafka Configuration'
     A                                      DSPATR(UL)
     A                                  2 70DATE
     A                                      EDTCDE(Y)
     A*=====================================================================
     A* User Profile Display
     A*=====================================================================
     A                                  4  2'User Profile:'
     A            USRPRF        10A  O  4 17DSPATR(HI)
     A*=====================================================================
     A* Configuration Fields
     A*=====================================================================
     A                                  6  2'Protocol:'
     A            KFPROTOC      16A  B  6 20
     A                                  6 38'(http or https)'
     A                                      COLOR(BLU)
     A                                  8  2'Broker:'
     A            KFBROKER      50A  B  8 20
     A                                  8 72'(1/2)'
     A                                      COLOR(BLU)
     A            KFBROKR2      50A  B  9 20
     A                                  9 72'(2/2)'
     A                                      COLOR(BLU)
     A                                 11  2'Port:'
     A            KFPORT         5S 0B 11 20EDTCDE(4)
     A                                 11 27'(default: 8082)'
     A                                      COLOR(BLU)
     A                                 13  2'Topic:'
     A            KFTOPIC       50A  B 13 20
     A                                 13 72'(1/2)'
     A                                      COLOR(BLU)
     A            KFTOPIC2      50A  B 14 20
     A                                 14 72'(2/2)'
     A                                      COLOR(BLU)
     A*=====================================================================
     A* Instructions
     A*=====================================================================
     A                                 17  2'Enter configuration values and -
     A                                      press Enter to save.'
     A                                      COLOR(BLU)
     A                                 18  2'Press F12 to cancel without sav-
     A                                      ing.'
     A                                      COLOR(BLU)
     A*=====================================================================
     A* Error Message Area
     A*=====================================================================
     A            ERRMSG        78A  O 21  2DSPATR(HI)
     A                                      COLOR(RED)
     A*=====================================================================
     A* Status Message Area
     A*=====================================================================
     A            STSMSG        78A  O 22  2COLOR(GRN)
     A*=====================================================================
     A* Function Keys
     A*=====================================================================
     A                                 23  2'F3=Exit  F12=Cancel'
     A                                      COLOR(BLU)
